
library(dplyr)
library(lubridate)

afsnt<-read.csv("C:/Desktop/Son/공모전/빅콘 2019/데이터_수정/AFSNT.csv")
colnames(afsnt)<-c("연","월","일","요일","공항","상대공항","항공사","편명","등록기호","출도착","부정기편","계획시각","실제시각","지연여부","지연사유","결항여부","결항사유") # 이름 한글로
str(afsnt)

# 불필요 데이터 삭제

afsnt_1<-afsnt[afsnt$부정기편=="N",] # 부정기편 삭제한 이유?
unique(afsnt_1$항공사)
afsnt_2<-afsnt_1[afsnt_1$결항여부=="N",]  # 결항 데이터 삭제한 이유?
afsnt_3<-subset(afsnt_2,select=-c(부정기편,결항여부,결항사유))
str(afsnt_3)

afsnt_3$dly<-ifelse(afsnt_3$지연여부=="N",0,1)
str(afsnt_3)

# 계획시간 지수 만들기

afsnt_3$계획시간_1<-round(hour(hm(afsnt_3$계획시각))+minute(hm(afsnt_3$계획시각))/60) # 계획시간 : minute은 반올림해서 시간대로 만든 변수 
afsnt_3[(hour(hm(afsnt_3$계획시각))==0|hour(hm(afsnt_3$계획시각))==1|hour(hm(afsnt_3$계획시각))==23),] # 23~1시 까지 
afsnt_3[afsnt_3$계획시간_1==23,]$계획시간_1 <- 22 # 23시 
dat2_3<-filter(afsnt_3,계획시간_1>=6 & 계획시간_1<=22 )


temp_FLT <- unique(dat2_3$계획시간_1)
head(dat2_3)
z_1<-dat2_3 %>%                        ## 계획시간별 지연율  
  group_by(계획시간_1) %>% 
  summarize(dly_mean=mean(dly)) 
barplot(z_1$dly_mean,names.arg = z_1$계획시간_1) 
z_2<-dat2_3 %>%                        ## 계획시간별 운행횟수 
  group_by(계획시간_1) %>% 
  summarize(drive=NROW(dly)) 
barplot(z_2$drive,names.arg = z_2$계획시간_1) 
View(dat2_3)
dat2_3[(dat2_3$계획시간_1==6 | dat2_3$계획시간_1==7),]$계획시간_1 <- 6.5
dat2_3[(dat2_3$계획시간_1==8 | dat2_3$계획시간_1==9),]$계획시간_1 <- 8.5
dat2_3[(dat2_3$계획시간_1==10 | dat2_3$계획시간_1==11),]$계획시간_1 <- 10.5
dat2_3[(dat2_3$계획시간_1==12 | dat2_3$계획시간_1==13),]$계획시간_1 <- 12.5
dat2_3[(dat2_3$계획시간_1==14 | dat2_3$계획시간_1==15),]$계획시간_1 <- 14.5
dat2_3[(dat2_3$계획시간_1==16 | dat2_3$계획시간_1==17),]$계획시간_1 <- 16.5
dat2_3[(dat2_3$계획시간_1==18 | dat2_3$계획시간_1==19),]$계획시간_1 <- 18.5
dat2_3[(dat2_3$계획시간_1==20 | dat2_3$계획시간_1==21),]$계획시간_1 <- 20.5

z_1<-dat2_3 %>%                        ## 계획시간별 지연율  
  group_by(계획시간_1) %>% 
  summarize(dly_mean=mean(dly)) 
z_2_2<-barplot(z_1$dly_mean,names.arg = z_1$계획시간_1) 
text(x=z_2_2,y=z_1$dly_mean,labels=round(z_1$dly_mean,2),pos=1)
z_2<-dat2_3 %>%                        ## 계획시간별 운행횟수 
  group_by(계획시간_1) %>% 
  summarize(drive=NROW(dly)) 
barplot(z_2$drive,names.arg = z_2$계획시간_1) 

dat2_3[(dat2_3$계획시간_1==14.5 | dat2_3$계획시간_1==16.5 | dat2_3$계획시간_1==18.5 | dat2_3$계획시간_1==20.5),]$계획시간지수 <- 2
dat2_3[(dat2_3$계획시간_1==12.5 | dat2_3$계획시간_1==10.5 ),]$계획시간지수 <- 1
dat2_3[(dat2_3$계획시간_1==6.5 | dat2_3$계획시간_1==8.5 | dat2_3$계획시간_1==22 ),]$계획시간지수 <- 0
View(dat2_3)


z_1<-dat2_3 %>%                        ## 계획시간별 지연율  
  group_by(계획시간_1) %>% 
  summarize(dly_mean=mean(dly)) 
barplot(z_1$dly_mean,names.arg = z_1$계획시간_1) 
z_2<-dat2_3 %>%                        ## 계획시간별 운행횟수 
  group_by(계획시간_1) %>% 
  summarize(drive=NROW(dly)) 
barplot(z_2$drive,names.arg = z_2$계획시간_1) 

dat2_3$계획시간지수<-0
dat2_3[dat2_3$계획시간_1==6,]$계획시간지수<-round(6/13,2)
dat2_3[dat2_3$계획시간_1==7,]$계획시간지수<-round(7/13,2)
dat2_3[dat2_3$계획시간_1==8,]$계획시간지수<-round(8/13,2)
dat2_3[dat2_3$계획시간_1==9,]$계획시간지수<-round(9/13,2)
dat2_3[dat2_3$계획시간_1==10,]$계획시간지수<-round(10/13,2)
dat2_3[dat2_3$계획시간_1==11,]$계획시간지수<-round(11/13,2)
dat2_3[dat2_3$계획시간_1==12,]$계획시간지수<-round(12/13,2)
dat2_3[dat2_3$계획시간_1==13,]$계획시간지수<-1
dat2_3[(dat2_3$계획시간_1>13 & dat2_3$계획시간_1<=18),]$계획시간지수<-1.4
dat2_3[dat2_3$계획시간_1==19,]$계획시간지수<-1
dat2_3[(dat2_3$계획시간_1==20 | dat2_3$계획시간_1==21),]$계획시간지수<-1.2
dat2_3[dat2_3$계획시간_1==22,]$계획시간지수<-round(9/13,2)

View(dat2_3)



dat2_3$연지수<-0
dat2_3[dat2_3$연==2019,]$연지수<-0.8
dat2_3[dat2_3$연==2018,]$연지수<-1.2
dat2_3[dat2_3$연==2017,]$연지수<-1
View(dat2_3)


dat2_3$요일지수<-0
dat2_3[dat2_3$요일=="금",]$요일지수<-1.5
dat2_3[(dat2_3$요일=="월" | dat2_3$요일=="목"),]$요일지수<-1.2
dat2_3[dat2_3$요일=="일",]$요일지수<-1
dat2_3[(dat2_3$요일=="수" | dat2_3$요일=="화"),]$요일지수<-0.8
dat2_3[dat2_3$요일=="토",]$요일지수<-0.6


dat2_3$항공사지수<-0
dat2_3[dat2_3$항공사=="I",]$항공사지수<-2
dat2_3[(dat2_3$항공사=="F" | dat2_3$항공사=="L" | dat2_3$항공사=="H"),]$항공사지수<-1.5
dat2_3[dat2_3$항공사=="A",]$항공사지수<-1
dat2_3[dat2_3$항공사=="B",]$항공사지수<-0.5
dat2_3[dat2_3$항공사=="J",]$항공사지수<-0

# 노선 지수

data5=dat2_3
line=paste(data5$공항,data5$상대공항,sep="_")
linedelay=as.data.frame(line)
linedelay=cbind(linedelay,DLY=data5$지연여부)
delaysum=linedelay %>% group_by(line) %>% summarise(delay=length(DLY))
delayyes=linedelay %>% group_by(line) %>% filter(DLY=="Y") %>% summarise(delay=length(DLY))
delayyes=c(delayyes$delay[1:22],0,delayyes$delay[23:40])
delayrate=delayyes/delaysum$delay
index=c(1.5,1.5,0.5,0,1.5,1.5,1.5,1.5,1.5,1.5,1,1,1.5,1,1.5,0.5,1.5,0,0,1,1,1,1.5,0,0,1.5,0,1.5,0,1,1.5,1.5,0,1.5,1.5,0,1.5,1.5,0,1.5,1.5)
index=cbind(delaysum,delayrate,index)
data5[,"line"]=paste(data5$공항,data5$상대공항,sep="_")
data5=left_join(data5,index,by="line")
data5$delay=ifelse(data5$delay<15000,0,ifelse(data5$delay<50000,0.5,ifelse(data5$delay<200000,1,1.5)))
dat2_3$노선지수 = data5$index

#추가된 변수
#line : 출발공항_도착공항
#delay : 노선별 운행횟수를 기준으로 범주화(15000이하/50000이하/200000이하/이상)
#delayrate : 노선별 지연율
#index : 0(운행횟수많고지연율높은것),0.5(운행횟수많고지연율낮은것),1(운행횟수적고지연율높은것),1.5(운행횟수적고지연율낮은것)

# 월 지수

dat2_3$월지수<-0
dat2_3[dat2_3$월==3,]$월지수<-0.5
dat2_3[(dat2_3$월==11 | dat2_3$월==12 | dat2_3$월==9 | dat2_3$월==7),]$월지수<-1
dat2_3[(dat2_3$월==10 | dat2_3$월==8),]$월지수<-1.2
dat2_3[(dat2_3$월==5 | dat2_3$월==6),]$월지수<-0.8
dat2_3[(dat2_3$월==1 | dat2_3$월==4 | dat2_3$월==2),]$월지수<-1.4

# 공항 지수

x_1<-c(17.4184994,15.0400956,26.4406664,16.38695532,5.14640916,19.25136251,8.531780645,16.98856734,7.760033152,2.233866979,8.130261419,24.18135056,7.270153846,13.14893968)
x_2<-(x_1-mean(x_1))/sd(x_1)
x_3<-round(x_2,2)
x_3

dat2_3$공항지수<-0
dat2_3[dat2_3$공항=="ARP1",]$공항지수<-x_3[1]
dat2_3[dat2_3$공항=="ARP2",]$공항지수<-x_3[2]
dat2_3[dat2_3$공항=="ARP3",]$공항지수<-x_3[3]
dat2_3[dat2_3$공항=="ARP4",]$공항지수<-x_3[4]
dat2_3[dat2_3$공항=="ARP5",]$공항지수<-x_3[5]
dat2_3[dat2_3$공항=="ARP6",]$공항지수<-x_3[6]
dat2_3[dat2_3$공항=="ARP7",]$공항지수<-x_3[7]
dat2_3[dat2_3$공항=="ARP8",]$공항지수<-x_3[8]
dat2_3[dat2_3$공항=="ARP9",]$공항지수<-x_3[9]
dat2_3[dat2_3$공항=="ARP11",]$공항지수<-x_3[10]
dat2_3[dat2_3$공항=="ARP12",]$공항지수<-x_3[11]
dat2_3[dat2_3$공항=="ARP13",]$공항지수<-x_3[12]
dat2_3[dat2_3$공항=="ARP14",]$공항지수<-x_3[13]
dat2_3[dat2_3$공항=="ARP15",]$공항지수<-x_3[14]

x_1<-c(21.81540217,19.03032505,20.18780611,19.3522139,6.377072219,25.27787599,13.86414355,20.59675863,10.38650591,2.707717551,8.424126289,26.74361287,13.57095385,6.732257118)
x_2<-(x_1-mean(x_1))/sd(x_1)
x_3<-round(x_2,2)
x_3

dat2_3$상대공항지수<-0
dat2_3[dat2_3$상대공항=="ARP1",]$상대공항지수<-x_3[1]
dat2_3[dat2_3$상대공항=="ARP2",]$상대공항지수<-x_3[2]
dat2_3[dat2_3$상대공항=="ARP3",]$상대공항지수<-x_3[3]
dat2_3[dat2_3$상대공항=="ARP4",]$상대공항지수<-x_3[4]
dat2_3[dat2_3$상대공항=="ARP5",]$상대공항지수<-x_3[5]
dat2_3[dat2_3$상대공항=="ARP6",]$상대공항지수<-x_3[6]
dat2_3[dat2_3$상대공항=="ARP7",]$상대공항지수<-x_3[7]
dat2_3[dat2_3$상대공항=="ARP8",]$상대공항지수<-x_3[8]
dat2_3[dat2_3$상대공항=="ARP9",]$상대공항지수<-x_3[9]
dat2_3[dat2_3$상대공항=="ARP11",]$상대공항지수<-x_3[10]
dat2_3[dat2_3$상대공항=="ARP12",]$상대공항지수<-x_3[11]
dat2_3[dat2_3$상대공항=="ARP13",]$상대공항지수<-x_3[12]
dat2_3[dat2_3$상대공항=="ARP14",]$상대공항지수<-x_3[13]
dat2_3[dat2_3$상대공항=="ARP15",]$상대공항지수<-x_3[14]




View(dat2_3)
write.csv(dat2_3,file="C:/Desktop/Son/공모전/빅콘 2019/데이터_수정/AFSNT_last.csv",row.names=FALSE)
str(dat2_3)
dat2_4<-dat2_3[,c(9,10,18,21,22,23,24)]  # 필요 변수만 모아 놓은 분석용 데이터
str(dat2_4)

# 추가적으로 예전에 소정이가 말했던 glm 에서 계수가 +인지 -인지를 보고 1,0으로 나눠서 해봐도 좋을듯 => 연,월,요일,공항,상대공항,항공사, 등등



# 13시 이전엔 6,7,8 등을 분자 , 13을 분모로 해서 지수 만들고 13시 이후엔 1로 고정해서 지수 만들기 (계획시간 지수 후보 2)
# 공항별 계획시간 지연율 보고  지수 만들기(계획시간 지수 후보 3)
# 국제선 국내선 공항 1,0 (공항 지수 추가 )
################ 중요 #################### => 수치를 직접적으로 주지말고 그냥 eda를 통해 범주 몇개씩 묶어서 범주를 크게크게 잡아서 나눈후 factor로 더미변수화 해서 넣으면 좀더 좋을지도?










